# GetItalicStatus Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormattedText..::..GetItalicStatus Method
FormattedText Class See Also
---
Returns whether All, None or a Mixed of characters in the entire text are italic.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public FormatStatus GetItalicStatus()
```

Visual Basic
---
```text
Public Function GetItalicStatus As FormatStatus
```

Visual C++
---
```text
public:
FormatStatus GetItalicStatus()
```

# ### Return Value
The format status of italic on characters FormatStatus.
# Remarks
This function only returns All or None if the entire text contains one character.
# See Also
FormattedText Class
GetItalicStatus Overload
Autodesk.Revit.DB Namespace